![title](./pic/merging/right_join/1_title.png)

In [10]:
import pandas as pd
import time
from IPython.display import Image

In [11]:
df_ids = pd.read_csv('./csv/merge_function/df_ids.csv', index_col=0)
df_passenger = pd.read_csv('./csv/merge_function/df_passenger.csv', index_col=0)

<br>

---

## Merge function: `right_join` mit `on=`

![title](./pic/merging/right_join/2_right_on.png)

<video width="1000" controls src="./pic/merging/right_join/3_right_example.mp4" />

In [13]:
df_passenger.head()

   PassengerId                                       Name     Sex
0          935      Corbett, Mrs. Walter H (Irene Colvin)  female
1         1023                  Gracie, Col. Archibald IV    male
2         1136  Johnston, Master. William Arthur Willie""    male
3         1044                         Storey, Mr. Thomas    male
4          954               Bjorklund, Mr. Ernst Herbert    male

In [14]:
df_ids.head()

   PassengerId  Survived
0         1297         0
1         1260         1
2         1153         0
3         1139         0
4          998         0

In [15]:
pd.merge(df_ids,
         df_passenger,
         how='right',
         on='PassengerId'
         )

     PassengerId  Survived                                       Name     Sex
0            935       1.0      Corbett, Mrs. Walter H (Irene Colvin)  female
1           1023       0.0                  Gracie, Col. Archibald IV    male
2           1136       0.0  Johnston, Master. William Arthur Willie""    male
3           1044       0.0                         Storey, Mr. Thomas    male
4            954       0.0               Bjorklund, Mr. Ernst Herbert    male
..           ...       ...                                        ...     ...
438          974       0.0                     Case, Mr. Howard Brown    male
439         1148       0.0                            Mahon, Mr. John    male
440         1238       0.0                 Botsford, Mr. William Hull    male
441          977       0.0                         Khalil, Mr. Betros    male
442         1095       1.0                 Quick, Miss. Winifred Vera  female

[443 rows x 4 columns]

In [16]:
len(df_passenger)

443

![title](./pic/merging/right_join/4_pid.png)

<br>

---

## Merge function: `right_join` mit `left_on=` & `right_on=`

![title](./pic/merging/right_join/5_right_olor.png)

In [18]:
df_passenger.rename({'PassengerId': 'pass_id'}, axis=1, inplace=True)
df_passenger.head()

   pass_id                                       Name     Sex
0      935      Corbett, Mrs. Walter H (Irene Colvin)  female
1     1023                  Gracie, Col. Archibald IV    male
2     1136  Johnston, Master. William Arthur Willie""    male
3     1044                         Storey, Mr. Thomas    male
4      954               Bjorklund, Mr. Ernst Herbert    male

In [20]:
pd.merge(df_ids,
         df_passenger,
         how='right',
         left_on='PassengerId',
         right_on='pass_id'
         )

,PassengerId,Survived,pass_id,Name,Sex
0,935.0,1.0,935,"Corbett, Mrs. Walter H (Irene Colvin)",female
1,1023.0,0.0,1023,"Gracie, Col. Archibald IV",male
2,1136.0,0.0,1136,"Johnston, Master. William Arthur Willie""""",male
3,1044.0,0.0,1044,"Storey, Mr. Thomas",male
4,954.0,0.0,954,"Bjorklund, Mr. Ernst Herbert",male
...,...,...,...,...,...
438,974.0,0.0,974,"Case, Mr. Howard Brown",male
439,1148.0,0.0,1148,"Mahon, Mr. John",male
440,1238.0,0.0,1238,"Botsford, Mr. William Hull",male
441,977.0,0.0,977,"Khalil, Mr. Betros",male
442,1095.0,1.0,1095,"Quick, Miss. Winifred Vera",female